1. Create a table called employees with the following structure?
  : emp_id (integer, should not be NULL and should be a primary key)Q
  : emp_name (text, should not be NULL)Q
  : age (integer, should have a check constraint to ensure the age is at least 18)Q
  : email (text, should be unique for each employee)Q
  : salary (decimal, with a default value of 30,000).

In [ ]:
-- Create the employees table
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY NOT NULL,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

This SQL query creates the `employees` table with the following columns and constraints:

- `emp_id`: An integer that serves as the primary key and cannot be NULL.
- `emp_name`: Text that cannot be NULL.
- `age`: An integer with a check constraint to ensure the age is at least 18.
- `email`: Text that must be unique for each employee.
- `salary`: A decimal with a default value of 30,000.

2. . Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints.

  Create a table called employees with the following structure? : emp_id (integer, should not be NULL and should be a primary key)Q : emp_name (text, should not be NULL)Q : age (integer, should have a check constraint to ensure the age is at least 18)Q : email (text, should be unique for each employee)Q : salary (decimal, with a default value of 30,000).
  Certainly! I can generate the SQL code to create the employees table with the specified structure and constraints.


  Explain the purpose of constraints and how they help maintain data integrity in a database. Provide examples of common types of constraints.
  Constraints are rules enforced on data columns in a table to limit the type of data that can be inserted into the table. This ensures the accuracy and reliability of the data. Here are some common types of constraints:

  NOT NULL: Ensures that a column cannot have a NULL value.
  UNIQUE: Ensures that all values in a column are different.
  PRIMARY KEY: A combination of a NOT NULL and UNIQUE constraint. It uniquely identifies each row in a table.
  FOREIGN KEY: Ensures that the values in a column (or a set of columns) in one table match the values in a column (or a set of columns) in another table. This establishes a link between two tables.
  CHECK: Ensures that all values in a column satisfy a specific condition.
  DEFAULT: Sets a default value for a column when no value is specified.

3. Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
your answer.

  You would apply the NOT NULL constraint to a column when you want to ensure that every row in the table has a value for that particular column. This is important for data integrity because it prevents missing information where it's required.

  A primary key cannot contain NULL values. This is because a primary key is defined to uniquely identify each row in a table. If a primary key column allowed NULL values, it would be impossible to guarantee that each row has a unique identifier, which violates the fundamental purpose of a primary key. A primary key is essentially a combination of a NOT NULL and UNIQUE constraint.

  Would you like me to demonstrate how to add a NOT NULL constraint to an existing table or show you more examples of other constraints?

4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint.

In [ ]:
ALTER TABLE employees
ADD CONSTRAINT unique_email UNIQUE (email);

In this example:
- `ALTER TABLE employees` specifies the table you want to modify.
- `ADD CONSTRAINT unique_email` adds a new constraint and gives it the name `unique_email`.
- `UNIQUE (email)` defines the type of constraint (UNIQUE) and the column it applies to (`email`).

To remove a constraint from an existing table, you also use the `ALTER TABLE` statement, but with the `DROP CONSTRAINT` clause. You need to know the name of the constraint you want to drop.

Here's an example of removing the `unique_email` constraint from the `employees` table:

In [ ]:
ALTER TABLE employees
DROP CONSTRAINT unique_email;

In this example:
- `ALTER TABLE employees` specifies the table you want to modify.
- `DROP CONSTRAINT unique_email` removes the constraint named `unique_email`.

Note that the exact syntax for adding and dropping constraints might vary slightly depending on the specific database system you are using (e.g., MySQL, PostgreSQL, SQL Server, SQLite). However, the general principle of using `ALTER TABLE` is consistent.

5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.

  Attempting to insert, update, or delete data that violates a constraint will result in an error. The database management system (DBMS) will prevent the operation from completing, thus preserving the integrity of the data in the table.

  The specific error message will vary depending on the type of constraint violated and the database system being used. However, they generally indicate that the operation failed because it would violate a rule defined by a constraint.

  Here's an example of a possible error message you might see when trying to insert a duplicate email into a table with a UNIQUE constraint on the email column (this is a generic example, the exact wording will differ by database system):

  ERROR: duplicate key value violates unique constraint "unique_email"
  DETAIL: Key (email)=(john.doe@example.com) already exists.
  This message clearly indicates that the insertion failed because the email address  already exists, violating the unique_email constraint.

  Would you like to explore specific examples of violating different types of constraints, such as NOT NULL or CHECK?

6. You created a products table without constraints as follows:

CREATE TABLE products (

    product_id INT,

    product_name VARCHAR(50),

    price DECIMAL(10, 2));
      *Now, you realise that?
      : The product_id should be a primary keyQ
      : The price should have a default value of 50.00

In [ ]:
-- Add a primary key constraint to the product_id column
ALTER TABLE products
ADD PRIMARY KEY (product_id);

-- Add a default value of 50.00 to the price column
ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

In the code above:

- The first `ALTER TABLE` statement adds a `PRIMARY KEY` constraint to the `product_id` column.
- The second `ALTER TABLE` statement uses `ALTER COLUMN` to set the `DEFAULT` value for the `price` column to 50.00.

Note that the syntax for setting a default value might vary slightly depending on the specific database system you are using.

                                                  ### SQL Commands

1. -Identify the primary keys and foreign keys in maven movies db. Discuss the differences

# Task
Identify the primary keys and foreign keys in maven movies db. Discuss the differences between primary keys and foreign keys and provide examples from the database.

## Understand the database schema

### Subtask:
Identify the tables in the `maven movies db` and the columns within each table.

**Reasoning**:
To identify the tables and their columns in the `maven movies db`, I need to connect to the database and query its schema. The necessary steps are to list the tables and then for each table, query its column information.

2.  List all details of actors

In [ ]:
SELECT *
FROM actor;

3. List all customer information from DB.

In [ ]:
SELECT *
FROM customer;

4. -List different countries.

In [ ]:
SELECT DISTINCT country
FROM country;

5. Display all active customers.

In [ ]:
SELECT *
FROM customer
WHERE active = 1;

6. List of all rental IDs for customer with ID 1

In [ ]:
SELECT rental_id
FROM rental
WHERE customer_id = 1;

7. Display all the films whose rental duration is greater than 5 .

In [ ]:
SELECT *
FROM film
WHERE rental_duration > 5;

8. List the total number of films whose replacement cost is greater than $15 and less than $20.

In [ ]:
SELECT COUNT(*)
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

9. - Display the count of unique first names of actors.

In [ ]:
SELECT COUNT(DISTINCT first_name)
FROM actor;

10. Display the first 10 records from the customer table .

In [ ]:
SELECT *
FROM customer
LIMIT 10;

11.  Display the first 3 records from the customer table whose first name starts with ‘b’.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

12. Display the names of the first 5 movies which are rated as ‘G’.

In [ ]:
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;

13. Find all customers whose first name starts with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A%';

14.  Find all customers whose first name ends with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%a';

15.  Display the list of first 4 cities which start and end with ‘a’ .

In [ ]:
SELECT city
FROM city
WHERE city LIKE 'a%a'
LIMIT 4;

16.  Find all customers whose first name have "NI" in any position.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%NI%';

17.  Find all customers whose first name have "r" in the second position .

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '_r%';

18.  Find all customers whose first name starts with "a" and are at least 5 characters in length.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'A%' AND LENGTH(first_name) >= 5;

19. Find all customers whose first name starts with "a" and ends with "o".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'a%o';

20.  Get the films with pg and pg-13 rating using IN operator.

In [ ]:
SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');

21. Get the films with length between 50 to 100 using between operator

In [ ]:
SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;

22. Get the top 50 actors using limit operator.

In [ ]:
SELECT *
FROM actor
LIMIT 50;

23. - Get the distinct film ids from inventory table.

In [ ]:
SELECT DISTINCT film_id
FROM inventory;

                                           #### Functions

                                          #### Basic Aggregate Functions:

1. Question 1:

Retrieve the total number of rentals made in the Sakila database.

Hint: Use the COUNT() function.

In [ ]:
SELECT COUNT(*)
FROM rental;

2. Question 2:

Find the average rental duration (in days) of movies rented from the Sakila database.

Hint: Utilize the AVG() function.

In [ ]:
SELECT AVG(rental_duration)
FROM film;

3. Question 3:

Display the first name and last name of customers in uppercase.

Hint: Use the UPPER () function.

In [ ]:
SELECT UPPER(first_name), UPPER(last_name)
FROM customer;

4. Question 4:

Extract the month from the rental date and display it alongside the rental ID.

Hint: Employ the MONTH() function.

In [ ]:
SELECT rental_id, MONTH(rental_date) AS rental_month
FROM rental;

5. Question 5:

Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

Hint: Use COUNT () in conjunction with GROUP BY

In [ ]:
SELECT customer_id, COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id;

6. Question 6:

Find the total revenue generated by each store.

Hint: Combine SUM() and GROUP BY.

In [ ]:
SELECT
    s.store_id,
    SUM(p.amount) AS total_revenue
FROM
    store s
JOIN
    staff st ON s.store_id = st.store_id
JOIN
    payment p ON st.staff_id = p.staff_id
GROUP BY
    s.store_id;

7. Question 7:

Determine the total number of rentals for each category of movies.

Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY.

In [ ]:
SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS total_rentals
FROM
    category c
JOIN
    film_category fc ON c.category_id = fc.category_id
JOIN
    film f ON fc.film_id = f.film_id
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    total_rentals DESC;

8. Question 8:

Find the average rental rate of movies in each language.

Hint: JOIN film and language tables, then use AVG () and GROUP BY.

In [ ]:
SELECT
    l.name AS language_name,
    AVG(f.rental_rate) AS average_rental_rate
FROM
    film f
JOIN
    language l ON f.language_id = l.language_id
GROUP BY
    l.name;

                                              ####  Joins

9. Questions 9 -

Display the title of the movie, customer s first name, and last name who rented it.

Hint: Use JOIN between the film, inventory, rental, and customer tables.

In [ ]:
SELECT
    f.title AS movie_title,
    c.first_name AS customer_first_name,
    c.last_name AS customer_last_name
FROM
    film f
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
JOIN
    customer c ON r.customer_id = c.customer_id;

10. Question 10:

Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

Hint: Use JOIN between the film actor, film, and actor tables.

In [ ]:
SELECT
    a.first_name,
    a.last_name
FROM
    actor a
JOIN
    film_actor fa ON a.actor_id = fa.actor_id
JOIN
    film f ON fa.film_id = f.film_id
WHERE
    f.title = 'Gone with the Wind';

11. Question 11:

Retrieve the customer names along with the total amount they've spent on rentals.

Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

In [ ]:
SELECT
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_spent DESC;

12. Question 12:

List the titles of movies rented by each customer in a particular city (e.g., 'London').

Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

In [ ]:
SELECT
    c.first_name,
    c.last_name,
    f.title AS movie_title
FROM
    customer c
JOIN
    address a ON c.address_id = a.address_id
JOIN
    city ci ON a.city_id = ci.city_id
JOIN
    rental r ON c.customer_id = r.customer_id
JOIN
    inventory i ON r.inventory_id = i.inventory_id
JOIN
    film f ON i.film_id = f.film_id
WHERE
    ci.city = 'London'
ORDER BY
    c.last_name, c.first_name, f.title;

                                #### Advanced Joins and GROUP BY:

13. Question 13:

Display the top 5 rented movies along with the number of times they've been rented.

Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

In [ ]:
SELECT
    f.title AS movie_title,
    COUNT(r.rental_id) AS rental_count
FROM
    film f
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    f.film_id, f.title
ORDER BY
    rental_count DESC
LIMIT 5;

14. Question 14:

Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

In [ ]:
SELECT
    c.customer_id,
    c.first_name,
    c.last_name
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
JOIN
    inventory i ON r.inventory_id = i.inventory_id
WHERE
    i.store_id IN (1, 2)
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    COUNT(DISTINCT i.store_id) = 2;

                                          ##### Windows Function:

1.

In [ ]:
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent,
    RANK() OVER (ORDER BY SUM(p.amount) DESC) as customer_rank
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_spent DESC;

2.  Calculate the cumulative revenue generated by each film over time.

In [ ]:
SELECT
    f.title AS film_title,
    p.payment_date,
    p.amount,
    SUM(p.amount) OVER (PARTITION BY f.film_id ORDER BY p.payment_date) AS cumulative_revenue
FROM
    film f
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
JOIN
    payment p ON r.rental_id = p.rental_id
ORDER BY
    f.title, p.payment_date;

3.  Determine the average rental duration for each film, considering films with similar lengths.

In [ ]:
SELECT
    film_id,
    title,
    rental_duration,
    AVG(rental_duration) OVER (PARTITION BY length) AS avg_rental_duration_by_length
FROM
    film
ORDER BY
    length, film_id;

4. Identify the top 3 films in each category based on their rental counts.

In [ ]:
WITH RankedFilms AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count,
        RANK() OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id) DESC) as category_rank
    FROM
        film f
    JOIN
        film_category fc ON f.film_id = fc.film_id
    JOIN
        category c ON fc.category_id = c.category_id
    JOIN
        inventory i ON f.film_id = i.film_id
    JOIN
        rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        f.film_id, f.title, c.category_id, c.name
)
SELECT
    film_id,
    title,
    category_name,
    rental_count
FROM
    RankedFilms
WHERE
    category_rank <= 3
ORDER BY
    category_name, category_rank;

5.  Calculate the difference in rental counts between each customer's total rentals and the average rentals

across all customers.

In [ ]:
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(r.rental_id) AS total_rentals,
    COUNT(r.rental_id) - (SELECT AVG(rental_count) FROM (SELECT COUNT(*) AS rental_count FROM rental GROUP BY customer_id) AS avg_rentals) AS difference_from_average
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    difference_from_average DESC;

6.  Find the monthly revenue trend for the entire rental store over time.

In [ ]:
SELECT
    strftime('%Y-%m', payment_date) AS payment_month,
    SUM(amount) AS monthly_revenue
FROM
    payment
GROUP BY
    payment_month
ORDER BY
    payment_month;

7.  Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [ ]:
WITH CustomerSpending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent
    FROM
        customer c
    JOIN
        payment p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
),
RankedCustomers AS (
    SELECT
        customer_id,
        first_name,
        last_name,
        total_spent,
        NTILE(5) OVER (ORDER BY total_spent DESC) as percentile_group
    FROM
        CustomerSpending
)
SELECT
    customer_id,
    first_name,
    last_name,
    total_spent
FROM
    RankedCustomers
WHERE
    percentile_group = 1
ORDER BY
    total_spent DESC;

8. Calculate the running total of rentals per category, ordered by rental count.

In [ ]:
WITH FilmRentalCounts AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM
        film f
    JOIN
        film_category fc ON f.film_id = fc.film_id
    JOIN
        category c ON fc.category_id = c.category_id
    JOIN
        inventory i ON f.film_id = i.film_id
    JOIN
        rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        f.film_id, f.title, c.name
)
SELECT
    film_id,
    title,
    category_name,
    rental_count,
    SUM(rental_count) OVER (PARTITION BY category_name ORDER BY rental_count) AS running_total_rentals_in_category
FROM
    FilmRentalCounts
ORDER BY
    category_name, rental_count;

9. Find the films that have been rented less than the average rental count for their respective categories.

In [ ]:
WITH FilmRentalCounts AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM
        film f
    JOIN
        film_category fc ON f.film_id = fc.film_id
    JOIN
        category c ON fc.category_id = c.category_id
    JOIN
        inventory i ON f.film_id = i.film_id
    JOIN
        rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        f.film_id, f.title, c.name
),
CategoryAverageRentals AS (
    SELECT
        category_name,
        AVG(rental_count) AS avg_category_rentals
    FROM
        FilmRentalCounts
    GROUP BY
        category_name
)
SELECT
    frc.film_id,
    frc.title,
    frc.category_name,
    frc.rental_count,
    car.avg_category_rentals
FROM
    FilmRentalCounts frc
JOIN
    CategoryAverageRentals car ON frc.category_name = car.category_name
WHERE
    frc.rental_count < car.avg_category_rentals
ORDER BY
    frc.category_name, frc.rental_count;

10.  Identify the top 5 months with the highest revenue and display the revenue generated in each month.

In [ ]:
SELECT
    strftime('%Y-%m', payment_date) AS payment_month,
    SUM(amount) AS monthly_revenue
FROM
    payment
GROUP BY
    payment_month
ORDER BY
    monthly_revenue DESC
LIMIT 5;

                                      ##### Normalisation & CTE

1.  First Normal Form (1NF):

 a. Identify a table in the Sakila database that violates 1NF. Explain how you

 would normalize it to achieve

# Task
Explain First Normal Form (1NF) and identify a table in the Sakila database that violates 1NF. Explain the violation and how to normalize it to achieve 1NF.

## Understand 1nf

### Subtask:
Briefly explain the definition of First Normal Form (1NF).

**Reasoning**:
I need to explain the definition of First Normal Form (1NF) and its key characteristics, which can be done in a markdown cell.

In [1]:
```markdown
First Normal Form (1NF) is the first step in the database normalization process. A table is considered to be in 1NF if it meets the following criteria:

1.  **Atomic Values**: Each column contains atomic values, meaning that each cell in the table should hold only a single value, not a list or a set of values.
2.  **No Repeating Groups**: There are no repeating groups of columns. This means that you should not have multiple columns within the same table that represent similar data for a single record (e.g., `phone1`, `phone2`, `phone3`).
3.  Each column has a unique name.
4.  The order of data does not matter.

SyntaxError: invalid decimal literal (ipython-input-1-3442202751.py, line 2)

**Reasoning**:
The previous command failed because markdown content was placed inside a python code block. I need to generate a markdown cell to explain the definition of First Normal Form (1NF) and its characteristics.

2.  Second Normal Form (2NF):

 a. Choose a table in Sakila and describe how you would determine whether it is in 2NF.

 If it violates 2NF,

# Task
Explain how to determine if a table in the Sakila database is in Second Normal Form (2NF) and, if it violates 2NF, describe how to normalize it.

## Understand 2nf

### Subtask:
Briefly explain the definition of Second Normal Form (2NF) and its requirement regarding partial dependencies.

**Reasoning**:
I need to explain the definition of Second Normal Form (2NF) and its requirement regarding partial dependencies in a markdown cell.

In [2]:
Second Normal Form (2NF) builds upon First Normal Form (1NF). A table is in 2NF if it meets the following conditions:

1.  **It is in 1NF**: The table must already satisfy all the requirements of 1NF (atomic values, no repeating groups, unique column names, order doesn't matter).
2.  **No Partial Dependencies**: All non-key attributes must be fully functionally dependent on the *entire* primary key.

A **partial dependency** occurs when a non-key attribute is dependent on only *part* of a composite primary key, rather than the entire key. In a table with a composite primary key (a primary key made up of two or more columns), if a non-key column's value can be determined by just one of the columns in the composite key, that's a partial dependency, and the table is not in 2NF.

SyntaxError: invalid decimal literal (ipython-input-2-4201612109.py, line 1)

**Reasoning**:
The previous command failed because markdown content was placed inside a python code block. I need to generate a markdown cell to explain the definition of Second Normal Form (2NF) and its requirement regarding partial dependencies.

In [3]:
```markdown
Second Normal Form (2NF) builds upon First Normal Form (1NF). A table is in 2NF if it meets the following conditions:

1.  **It is in 1NF**: The table must already satisfy all the requirements of 1NF (atomic values, no repeating groups, unique column names, order doesn't matter).
2.  **No Partial Dependencies**: All non-key attributes must be fully functionally dependent on the *entire* primary key.

A **partial dependency** occurs when a non-key attribute is dependent on only *part* of a composite primary key, rather than the entire key. In a table with a composite primary key (a primary key made up of two or more columns), if a non-key column's value can be determined by just one of the columns in the composite key, that's a partial dependency, and the table is not in 2NF.

SyntaxError: invalid decimal literal (ipython-input-3-3685775788.py, line 2)

3. Third Normal Form (3NF):

 a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies

 present and outline the steps to normali

## Select a table

### Subtask:
Choose a table in the Sakila database that is in 1NF and has a composite primary key.

**Reasoning**:
To identify tables with composite primary keys in the Sakila database, I need to query the database's metadata. I will use SQL queries to inspect the schema and identify tables with multi-column primary keys. Then I will select one such table.

In [4]:
-- Connect to the Sakila database (assuming a connection is already established)

-- Query to get table names
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'sakila';

-- Query to get primary key columns for each table
SELECT
    tc.table_name,
    kcu.column_name,
    kcu.ordinal_position
FROM
    information_schema.table_constraints AS tc
JOIN
    information_schema.key_column_usage AS kcu
ON tc.constraint_name = kcu.constraint_name
AND tc.table_schema = kcu.table_schema
AND tc.table_name = kcu.table_name
WHERE tc.constraint_type = 'PRIMARY KEY' AND tc.table_schema = 'sakila'
ORDER BY tc.table_name, kcu.ordinal_position;

SyntaxError: invalid syntax (ipython-input-4-2322088195.py, line 1)

**Reasoning**:
The previous command failed because SQL comments were placed within a Python code block. I need to execute the SQL queries to identify tables with composite primary keys in the Sakila database.

In [5]:
%sql SELECT table_name FROM information_schema.tables WHERE table_schema = 'sakila';
%sql SELECT tc.table_name, kcu.column_name, kcu.ordinal_position FROM information_schema.table_constraints AS tc JOIN information_schema.key_column_usage AS kcu ON tc.constraint_name = kcu.constraint_name AND tc.table_schema = kcu.table_schema AND tc.table_name = kcu.table_name WHERE tc.constraint_type = 'PRIMARY KEY' AND tc.table_schema = 'sakila' ORDER BY tc.table_name, kcu.ordinal_position;

UsageError: Line magic function `%sql` not found.

**Reasoning**:
The `%sql` magic command is not available, indicating that the necessary extension is not loaded. I need to load the SQL extension and then execute the queries to identify tables with composite primary keys.

In [6]:
%load_ext sql
%sql SELECT table_name FROM information_schema.tables WHERE table_schema = 'sakila';
%sql SELECT tc.table_name, kcu.column_name, kcu.ordinal_position FROM information_schema.table_constraints AS tc JOIN information_schema.key_column_usage AS kcu ON tc.constraint_name = kcu.constraint_name AND tc.table_schema = kcu.table_schema AND tc.table_name = kcu.table_name WHERE tc.constraint_type = 'PRIMARY KEY' AND tc.table_schema = 'sakila' ORDER BY tc.table_name, kcu.ordinal_position;

Traceback (most recent call last):
  File "/usr/local/lib/python3.11/dist-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/usr/local/lib/python3.11/dist-packages/sql/connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
Traceback (most recent call last):
  File "/usr/local/lib/python3.11/dist-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/usr/local/lib/python3.11/dist-packages/sql/connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

**Reasoning**:
The error indicates that a database connection is required. I need to establish a connection to the Sakila database using the `%sql` magic command with the correct connection string. Since the context mentions 'maven movies db' which is likely the Sakila database, I will assume the database is accessible locally and try to connect to it.

In [7]:
%load_ext sql
%sql sqlite:///sakila.db
%sql SELECT table_name FROM information_schema.tables WHERE table_schema = 'sakila';
%sql SELECT tc.table_name, kcu.column_name, kcu.ordinal_position FROM information_schema.table_constraints AS tc JOIN information_schema.key_column_usage AS kcu ON tc.constraint_name = kcu.constraint_name AND tc.table_schema = kcu.table_schema AND tc.table_name = kcu.table_name WHERE tc.constraint_type = 'PRIMARY KEY' AND tc.table_schema = 'sakila' ORDER BY tc.table_name, kcu.ordinal_position;

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * sqlite:///sakila.db
(sqlite3.OperationalError) no such table: information_schema.tables
[SQL: SELECT table_name FROM information_schema.tables WHERE table_schema = 'sakila' ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///sakila.db
(sqlite3.OperationalError) no such table: information_schema.table_constraints
[SQL: SELECT tc.table_name, kcu.column_name, kcu.ordinal_position FROM information_schema.table_constraints AS tc JOIN information_schema.key_column_usage AS kcu ON tc.constraint_name = kcu.constraint_name AND tc.table_schema = kcu.table_schema AND tc.table_name = kcu.table_name WHERE tc.constraint_type = 'PRIMARY KEY' AND tc.table_schema = 'sakila' ORDER BY tc.table_name, kcu.ordinal_position;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

4.  Normalization Process:

 a. Take a specific table in Sakila and guide through the process of normalizing it from the initial

 unnormalized form up to at least 2NF.

# Task
Explain the normalization process in SQL, specifically focusing on achieving First Normal Form (1NF) and Second Normal Form (2NF) using examples from the Sakila database.

## Create an unnormalized table (hypothetical)

### Subtask:
Define a hypothetical table based on Sakila data that is in an unnormalized form. This table will include repeating groups or multi-valued attributes to violate 1NF. For example, a table combining customer information and multiple rentals in a single row with columns like `rental1_date`, `rental2_date`, `film1_title`, `film2_title`, etc.

**Reasoning**:
I need to define a hypothetical unnormalized table structure in a markdown cell as per the instructions.